-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Host: db:3306
-- Generation Time: Oct 27, 2025 at 04:21 PM
-- Server version: 9.4.0
-- PHP Version: 8.2.27

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `SAT`
--

-- --------------------------------------------------------

--
-- Table structure for table `lab_answers`
--

CREATE TABLE `lab_answers` (
  `id` int NOT NULL,
  `content` longtext CHARACTER SET utf8mb3 COLLATE utf8mb3_bin NOT NULL,
  `type` tinyint(1) NOT NULL DEFAULT '0',
  `questionId` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `lab_answers`
--

INSERT INTO `lab_answers` (`id`, `content`, `type`, `questionId`) VALUES
(1136, 'การใช้เทคโนโลยีแฮ็กระบบ', 0, 401),
(1137, 'การโจมตีโดยใช้เทคนิคการหลอกลวงทางจิตวิทยา', 1, 401),
(1138, 'การโจมตีแบบ brute-force', 0, 401),
(1139, 'การโจมตีที่ใช้ไวรัส', 0, 401),
(1140, 'การส่งอีเมลปลอม', 0, 402),
(1141, 'การใช้ไวรัสเข้ารหัสไฟล์', 1, 402),
(1142, 'การแอบอ้างเป็นฝ่าย IT', 0, 402),
(1143, 'การโทรศัพท์หลอกถามรหัสผ่าน', 0, 402),
(1144, 'ผู้คนใช้รหัสผ่านอ่อน', 0, 403),
(1145, 'ใช้ซอฟต์แวร์ที่ล้าสมัย', 0, 403),
(1146, 'เหยื่อมักถูกหลอกด้วยความเร่งรีบหรือไว้วางใจ', 1, 403),
(1147, 'ใช้เทคนิคจาก Machine Learning', 0, 403),
(1152, 'ขโมยข้อมูลส่วนตัว', 1, 404),
(1153, 'สร้างความน่าเชื่อถือขององค์กร', 0, 404),
(1154, 'ขู่กรรโชกหรือแบล็กเมล', 1, 404),
(1155, 'เก็บข้อมูลเพื่อวางแผนโจมตีเพิ่ม', 1, 404),
(1173, 'Report Email as Phishing', 1, 416),
(1599, 'การส่งข้อมูลปลอมที่ก่อให้เกิดความตื่นตระหนกแก่ประชาชน', 1, 534),
(1600, 'การเข้าถึงระบบคอมพิวเตอร์โดยไม่ได้รับอนุญาต', 1, 534),
(1601, 'การเก็บข้อมูลส่วนบุคคลของลูกค้าโดยไม่ขอความยินยอม', 0, 534),
(1602, 'การสร้างมัลแวร์เพื่อโจมตีระบบของหน่วยงานรัฐ', 1, 534),
(1603, 'การกำหนดมาตรการให้หน่วยงานโครงสร้างพื้นฐานสำคัญทางสารสนเทศ (Critical Information Infrastructure) ป้องกันความเสี่ยงไซเบอร์', 1, 535),
(1604, 'การควบคุมดูแลการใช้คุกกี้เพื่อเก็บข้อมูลผู้ใช้งานบนเว็บไซต์', 0, 535),
(1605, 'การกำหนดโทษจำคุกผู้เผยแพร่ข้อมูลเท็จผ่านสื่อออนไลน์', 0, 535),
(1606, 'ถูกทุกข้อ', 0, 535),
(1607, 'พ.ร.บ.คอมพิวเตอร์', 0, 536),
(1608, 'พ.ร.บ.คุ้มครองข้อมูลส่วนบุคคล (PDPA)', 1, 536),
(1609, 'พ.ร.บ.การรักษาความมั่นคงไซเบอร์', 0, 536),
(1610, 'กฎหมายระหว่างประเทศด้านข้อมูล', 0, 536),
(1611, 'การโพสต์ข่าวปลอมในสื่อสังคมออนไลน์', 0, 537),
(1612, 'การที่ธนาคารไม่จัดทำมาตรการรักษาความปลอดภัยระบบเครือข่าย', 0, 537),
(1613, 'การโฆษณาผลิตภัณฑ์โดยใช้ข้อมูลส่วนบุคคลที่ลูกค้าไม่ได้อนุญาต', 0, 537),
(1614, 'การเจาะระบบเซิร์ฟเวอร์มหาวิทยาลัยและนำข้อมูลนักศึกษาออกมาเผยแพร่', 1, 537),
(1615, 'ปกป้องโครงสร้างพื้นฐานที่สำคัญทางสารสนเทศ', 0, 538),
(1616, 'กำหนดมาตรฐานการเก็บรักษาข้อมูลส่วนบุคคล', 0, 538),
(1617, 'ลงโทษผู้กระทำความผิดเกี่ยวกับการโจมตีระบบคอมพิวเตอร์', 0, 538),
(1618, 'ส่งเสริมการแลกเปลี่ยนข้อมูลข่าวสารโดยไม่จำกัดสิทธิส่วนบุคคล', 1, 538),
(1690, 'อีเมลมีการแนบไฟล์ PDF จากธนาคาร', 0, 571),
(1691, 'อีเมลใช้ภาษาทางการ ไม่มีคำผิด', 0, 571),
(1692, 'อีเมลแจ้งโปรโมชั่นส่วนลด', 0, 571),
(1693, 'อีเมลมีการสะกดผิดและใช้ข้อความเร่งด่วน เช่น “บัญชีของคุณถูกล็อค!”', 1, 571),
(1694, 'ตรวจสอบที่อยู่อีเมลผู้ส่งให้แน่ใจว่าเป็นโดเมนที่ถูกต้อง', 1, 572),
(1695, 'คลิกลิงก์ทันทีเพื่อยืนยันบัญชีตามที่อีเมลร้องขอ', 0, 572),
(1696, 'ใช้การยืนยันตัวตนแบบสองชั้น (2FA)', 1, 572),
(1697, 'รายงานอีเมลที่น่าสงสัยไปยังหน่วยงานที่เกี่ยวข้อง', 1, 572),
(1698, 'ให้ข้อมูลส่วนตัวกับอีเมลที่อ้างว่าเป็นธนาคาร', 0, 572),
(1699, 'ส่งจากอีเมลที่เป็นทางการขององค์กร', 0, 573),
(1700, 'ใช้ข้อความโฆษณา/แจกรางวัลที่เกินจริง', 1, 573),
(1701, 'ส่งถึงกลุ่มเป้าหมายเฉพาะกลุ่ม', 0, 573),
(1702, 'แนบไฟล์ที่มีลายน้ำองค์กร', 0, 573),
(1703, 'รายงานไปยังผู้ให้บริการอีเมล', 1, 574),
(1704, 'ลบข้อความนั้น', 1, 574),
(1705, 'คลิกลิงก์ในอีเมลเพื่อตรวจสอบ', 0, 574),
(1706, 'หลีกเลี่ยงการดาวน์โหลดไฟล์แนบที่ไม่รู้จัก', 1, 574),
(1707, 'ปล่อยทิ้งไว้เฉย ๆ', 0, 574),
(1708, 'รายงาน Spam คุณถูกรางวัล Jackpot', 1, 575),
(1709, 'การอ้างว่าผู้ใช้ได้รับรางวัลใหญ่เกินจริง', 1, 576),
(1710, 'การใช้โดเมนอีเมลที่ไม่ตรงกับหน่วยงานจริง', 1, 576),
(1711, 'เนื้อหากำหนดเส้นตายเร่งด่วน เช่น “บัญชีจะถูกระงับใน 24 ชั่วโมง”', 1, 576),
(1712, 'มีการแนบไฟล์ประกอบ', 0, 576),
(1713, 'ปิดป็อปอัพ', 1, 577),
(1714, 'มีการอ้างว่า “ฟรี” และ “หมดเวลาเร็ว ๆ นี้”', 1, 578),
(1715, 'มีการใช้สีสันสดใสในโฆษณา', 0, 578),
(1716, 'มีปุ่มให้กดดาวน์โหลด', 0, 578),
(1717, 'มีตัวอักษรภาษาไทยปนภาษาอังกฤษ', 0, 578),
(1718, 'ผู้ใช้ได้รับอีเมลแจ้งเตือนว่า “บัญชีธนาคารของคุณถูกล็อก” และต้องกดลิงก์ไปกรอกข้อมูล', 0, 579),
(1719, 'พบแฟลชไดรฟ์ไม่ทราบแหล่งที่มาในที่จอดรถและเสียบเข้าคอมพิวเตอร์เพื่อตรวจสอบไฟล์', 1, 579),
(1720, 'ผู้ใช้กดลิงก์ไปยังเว็บไซต์ที่มีหน้าเว็บปลอมเลียนแบบธนาคาร', 0, 579),
(1721, 'ได้รับข้อความจากเพื่อนใน Facebook พร้อมแนบไฟล์วิดีโอที่ติดมัลแวร์', 0, 579),
(1722, 'การแจกไฟล์เพลงหรือซอฟต์แวร์ฟรีบนเว็บไซต์ที่ไม่น่าเชื่อถือ', 1, 580),
(1723, 'การแจ้งว่าผู้ใช้ได้รับรางวัล iPhone ฟรีและให้กดลิงก์ยืนยัน', 1, 580),
(1724, 'การปล่อยแฟลชไดรฟ์ติดไวรัสในที่สาธารณะ เช่น ลานจอดรถ', 0, 580),
(1725, 'การสร้างเว็บไซต์ปลอมเลียนแบบธนาคารให้ผู้ใช้กรอกข้อมูล', 1, 580),
(1726, 'การแจกของฟรีในงานสัมมนาที่ถูกดัดแปลงให้ติดมัลแวร์', 1, 580),
(1727, 'โทรตรงหาผู้ใช้โดยอ้างเป็น Microsoft Support', 0, 581),
(1728, 'ส่ง popup หรือ alert หลอกบนเว็บไซต์', 0, 581),
(1729, 'ขอให้ผู้ใช้เปลี่ยนรหัสผ่านในระบบ IT ของบริษัท', 1, 581),
(1730, 'ขอ remote access ผ่าน TeamViewer/AnyDesk', 0, 581),
(1731, 'สูญเสียเงินจากการจ่ายค่าบริการปลอม', 1, 582),
(1732, 'ได้รับสิทธิ์การสนับสนุนจริงจาก Microsoft', 0, 582),
(1733, 'ข้อมูลส่วนตัว/ข้อมูลบัตรเครดิตถูกขโมย', 1, 582),
(1734, 'ได้รับซอฟต์แวร์ถูกลิขสิทธิ์', 0, 582),
(1735, 'ปิดหน้าต่าง', 1, 583),
(1736, 'มีเบอร์โทรศัพท์ที่ไม่เป็นทางการ', 1, 584),
(1737, 'บังคับให้ชำระเงินทันที', 1, 584),
(1738, 'ขู่จะ “ล็อกคอมพิวเตอร์”', 1, 584),
(1739, 'แสดงข้อความจากระบบจริงของ Windows', 0, 584),
(1740, 'ใช้ข้อความข่มขู่ (“หากไม่ดำเนินการตอนนี้ ข้อมูลคุณจะหาย”)', 1, 585),
(1741, 'แจ้งเตือนจำนวนไวรัสเกินจริง เช่น “ตรวจพบไวรัส 500 ตัว”', 1, 585),
(1742, 'มาพร้อมกับการขอข้อมูลบัตรเครดิตเพื่อ “activate”', 1, 585),
(1743, 'มาจากโปรแกรมป้องกันไวรัสที่ผู้ใช้ติดตั้งเอง', 0, 585),
(1744, 'เสนอให้ดาวน์โหลด/ซื้อซอฟต์แวร์ทันที', 1, 585),
(1745, 'Closed popup', 1, 586),
(1746, 'แจ้งจำนวนไวรัสที่มากเกินจริง', 1, 587),
(1747, 'แสดงผลตรวจจากซอฟต์แวร์ที่ผู้ใช้ติดตั้งจริง', 0, 587),
(1748, 'บังคับให้ซื้อซอฟต์แวร์ทันที', 1, 587),
(1749, 'แสดงข้อความรีวิวจากผู้ใช้งานจริง', 0, 587),
(1750, 'ใช้ข้อความขู่ เช่น “serious risk”', 1, 587),
(1759, 'สามารถทำงานได้โดยไม่ต้องเปิดไฟล์', 0, 590),
(1760, 'มักมาพร้อมกับโปรแกรมฟรีแวร์', 0, 590),
(1761, 'ใช้ช่องโหว่ระบบปฏิบัติการโดยตรง', 0, 590),
(1762, 'สามารถฝังตัวในไฟล์หรือโปรแกรม และแพร่กระจายเมื่อไฟล์ถูกเปิดใช้งาน', 1, 590),
(1763, 'การทำลายหรือลบข้อมูล', 1, 591),
(1764, 'การขโมยข้อมูลสำคัญ เช่น รหัสผ่าน', 1, 591),
(1765, 'การเพิ่มประสิทธิภาพของระบบ', 0, 591),
(1766, 'การติดตั้งโปรแกรมที่ช่วยทำให้มัลแวร์ทุกชนิดในคอมพิวเตอร์ถูกลบ', 0, 591),
(1767, 'ทำให้เครื่องทำงานช้าลง', 1, 591),
(1779, 'https://www.avast.com', 1, 596),
(1780, 'ใช้คำว่า \"100% Secure\" ในชื่อเว็บ', 0, 597),
(1781, 'ใช้ HTTPS', 1, 597),
(1782, 'มีโดเมน .xyz / .ru / .info', 0, 597),
(1783, 'เป็นโดเมนหลัก/บริษัทจริง', 1, 597),
(1784, 'มีคะแนนรีวิวสูงและจำนวนผู้ใช้มาก', 1, 597),
(1785, 'https://notepad-plus-plus.org/repository/8.x/8.6.2/npp.8.6.2.Installer.exe', 1, 598),
(1786, 'URL ไม่ใช่ของเว็บไซต์ทางการ แต่เป็นโดเมนที่ไม่คุ้นเคย', 1, 599),
(1787, 'ชื่อไฟล์ไม่ตรงกับโปรแกรมที่ผู้ใช้ตั้งใจจะดาวน์โหลด', 1, 599),
(1788, 'ใช้ HTTPS และมาจากเว็บ official', 0, 599),
(1789, 'Popup ที่บังคับให้กดดาวน์โหลด', 1, 599),
(1790, 'Trojan สามารถแพร่กระจายตัวเองได้โดยไม่ต้องพึ่งพาผู้ใช้', 0, 600),
(1791, 'Trojan มักจะแฝงมาในโปรแกรมที่ดูปลอดภัยเพื่อลวงผู้ใช้ติดตั้ง', 1, 600),
(1792, 'Trojan ไม่สามารถขโมยข้อมูลส่วนตัวได้', 0, 600),
(1793, 'Trojan ทำงานแบบไฟล์แนบอีเมลเท่านั้น', 0, 600),
(1794, 'ติดตั้งและอัปเดตแอนตี้ไวรัสที่เชื่อถือได้', 1, 601),
(1795, 'อัปเดตระบบและซอฟต์แวร์อย่างสม่ำเสมอ', 1, 601),
(1796, 'ดาวน์โหลดไฟล์จากอีเมลที่ไม่รู้จักเพื่อทดสอบ', 0, 601),
(1797, 'ใช้ไฟร์วอลล์เพื่อตรวจสอบการเข้าถึงที่ผิดปกติ', 1, 601),
(1798, 'สำรองข้อมูลเป็นประจำ', 1, 601),
(1799, 'Free PDF Converter', 1, 602),
(1800, 'โปรแกรมจะติดตั้งโดยไม่มีปัญหา', 0, 603),
(1801, 'ShoppingHelper Toolbar ถูกติดตั้ง (spyware)', 1, 603),
(1802, 'SpySearch ถูกตั้งเป็น default search (hijack)', 1, 603),
(1803, 'โปรแกรมจะเพิ่มประสิทธิภาพ PDF ฟรีอย่างเดียว', 0, 603),
(1804, 'เพื่อบังคับผู้ใช้จ่ายเงินเพิ่ม', 0, 604),
(1805, 'เพื่อทำให้ installer สวยขึ้น', 0, 604),
(1806, 'เพื่อให้ผู้ใช้ตั้งค่าโปรแกรมหลักได้เร็วขึ้น', 0, 604),
(1807, 'เพื่อเพิ่มโอกาสให้ผู้ใช้ติดตั้ง software อื่นโดยไม่รู้ตัว', 1, 604),
(1808, 'ปิด Popup Adware', 1, 605),
(1809, 'ได้โปรแกรมเวอร์ชันล่าสุดทันที', 0, 606),
(1810, 'อินเทอร์เน็ตเร็วขึ้น', 0, 606),
(1811, 'เครื่องปลอดภัยเหมือนเดิม', 0, 606),
(1812, 'มีการติดตั้งซอฟต์แวร์ไม่พึงประสงค์หรือโฆษณาแฝงลงในเครื่อง', 1, 606),
(1813, 'แสดงโฆษณาหรือ Popup เด้งขึ้นมาขณะใช้งาน', 1, 607),
(1814, 'ไม่มีผลกระทบอะไรต่อการใช้งานเครื่อง', 0, 607),
(1815, 'มักแถมมากับโปรแกรมฟรีที่ดาวน์โหลดจากเว็บไซต์ไม่เป็นทางการ', 1, 607),
(1816, 'อาจติดตั้ง Toolbar หรือ Plugin โดยไม่ได้รับอนุญาต', 1, 607),
(1817, 'ใช้การแพร่กระจายผ่านเครือข่ายอินเทอร์เน็ต', 0, 607),
(1818, 'ลบอีเมลนี้ทันที', 1, 608),
(1819, 'ตรวจสอบผู้ส่งและโดเมนให้แน่ใจก่อนเปิดไฟล์แนบ', 1, 609),
(1820, 'หลีกเลี่ยงการเปิดไฟล์ที่มีนามสกุล .docm, .exe, .zip จากแหล่งที่ไม่น่าเชื่อถือ', 1, 609),
(1821, 'จ่ายค่าไถ่ทันทีถ้าพบข้อความ ransomware', 0, 609),
(1822, 'ติดต่อกลับไปที่อีเมลผู้ส่งเพื่อสอบถามรายละเอียด', 0, 609),
(1823, 'เข้ารหัสข้อมูลและเรียกค่าไถ่เพื่อปลดล็อก', 1, 610),
(1824, 'สแกนไฟล์ทั้งหมดแล้วลบโดยทันที', 0, 610),
(1825, 'ปลอมตัวเป็นโฆษณาเพื่อแสดงป๊อปอัพ', 0, 610),
(1826, 'ใช้ทรัพยากรเครื่องเพื่อขุดเหรียญดิจิทัล', 0, 610),
(1827, 'ติดตั้งและอัปเดตโปรแกรมป้องกันไวรัส', 1, 611),
(1828, 'สำรองข้อมูลอย่างสม่ำเสมอ', 1, 611),
(1829, 'จ่ายเงินค่าไถ่เพื่อให้ได้ไฟล์คืนเร็วขึ้น', 0, 611),
(1830, 'หลีกเลี่ยงการดาวน์โหลดไฟล์จากแหล่งไม่น่าเชื่อถือ', 1, 611),
(1831, 'ดาวน์โหลดไฟล์จากแหล่งไม่น่าเชื่อถือ', 0, 611),
(1832, 'เกิดจากการสแกนพอร์ตของเครื่องเป้าหมายเพียงเครื่องเดียว', 0, 612),
(1833, 'เกิดจากการฝังมัลแวร์ลงในระบบเพื่อดักข้อมูล', 0, 612),
(1834, 'เกิดจากการส่งคำขอจำนวนมากจากหลายแหล่ง', 1, 612),
(1835, 'เกิดจากการเข้าถึงด้วยสิทธิ์ผู้ดูแลระบบ', 0, 612),
(1836, 'เว็บไซต์ทำงานได้เร็วขึ้นเพราะมีการเชื่อมต่อจำนวนมาก', 0, 613),
(1837, 'เว็บไซต์ถูกเปลี่ยนหน้าไปเป็นเว็บปลอมทันที', 0, 613),
(1838, 'เว็บไซต์ถูกเข้ารหัสไฟล์ทั้งหมด', 0, 613),
(1839, 'เว็บไซต์ถูกปิดการให้บริการชั่วคราวหรือทำงานช้าลง', 1, 613),
(1840, 'ใช้บริการป้องกัน DDoS จากผู้ให้บริการ เช่น Cloudflare หรือ AWS Shield', 1, 614),
(1841, 'ปล่อยให้ระบบรับคำขอทั้งหมดเองโดยไม่แก้ไขใด ๆ', 0, 614),
(1842, 'ตั้งค่า Firewall เพื่อกรองการเข้าถึงที่ผิดปกติ', 1, 614),
(1843, 'ใช้ Load Balancing เพื่อกระจายโหลด', 1, 614),
(1849, 'การสกัดกั้น DNS และเปลี่ยนเส้นทางไปยังเซิร์ฟเวอร์ปลอม', 0, 617),
(1850, 'การบังคับให้การเชื่อมต่อไม่เข้ารหัสเพื่อดักจับข้อมูล', 1, 617),
(1851, 'การสร้าง Wi-Fi ปลอมเพื่อดักจับผู้ใช้', 0, 617),
(1852, 'การปลอมเป็นอีเมลทางการเพื่อขโมยข้อมูล', 0, 617),
(1853, 'Wi-Fi ฟรีจากห้างสรรพสินค้า', 0, 618),
(1854, 'Wi-Fi ที่ต้องใช้รหัสผ่าน WPA2', 0, 618),
(1855, 'Wi-Fi ที่ได้รับจากผู้ให้บริการโทรคมนาคม', 0, 618),
(1856, 'Wi-Fi ที่ตั้งชื่อเหมือนเครือข่ายจริง แต่ถูกควบคุมโดยแฮกเกอร์', 1, 618),
(1857, 'ใช้ HTTP ธรรมดา', 0, 619),
(1858, 'ใช้ VPN', 1, 619),
(1859, 'ปิดการเข้ารหัส SSL', 0, 619),
(1860, 'ปิด Firewall', 0, 619),
(1861, 'หลีกเลี่ยงการใช้ HTTPS', 0, 620),
(1862, 'ใช้ VPN', 1, 620),
(1863, 'หลีกเลี่ยงการเปิดอีเมล Phishing', 1, 620),
(1864, 'เชื่อมต่อกับ Wi-Fi สาธารณะโดยตรง', 0, 620),
(1865, 'ออกจากหน้าเว็บ', 1, 621),
(1866, 'มี logo ของธนาคาร', 0, 622),
(1867, 'SSL indicator สีแดง', 1, 622),
(1868, 'ช่อง Username/Password ปกติ', 0, 622),
(1869, 'URL ใช้ http:// แทน https://', 1, 622),
(1870, 'สมัครสมาชิกสำเร็จ', 1, 623),
(1871, 'เพราะจำยาก', 0, 624),
(1872, 'เพราะเว็บจะไม่ยอมให้ใช้ซ้ำ', 0, 624),
(1873, 'เพราะถ้าบัญชีหนึ่งถูกแฮก บัญชีอื่นก็จะเสี่ยงถูกเจาะได้', 1, 624),
(1874, 'เพราะทำให้ระบบทำงานช้า', 0, 624),
(1875, 'คลิกลิงก์แล้วเปลี่ยนทันที', 0, 625),
(1876, 'ตรวจสอบว่าอีเมลมาจากแหล่งจริงหรือไม่ และเข้าเว็บโดยตรงแทนการคลิกลิงก์', 1, 625),
(1877, 'ส่งรหัสผ่านให้ทีม IT ผ่านอีเมล', 0, 625),
(1878, 'รายงานว่าเป็นอีเมลฟิชชิ่ง', 1, 625),
(1879, 'ใช้ Password Manager', 1, 626),
(1880, 'จดรหัสผ่านทุกบัญชีลงกระดาษแล้วแปะที่หน้าจอ', 0, 626),
(1881, 'เปิดการยืนยันตัวตนสองชั้น (2FA)', 1, 626),
(1882, 'เปลี่ยนรหัสผ่านเมื่อสงสัยว่าถูกเปิดเผย', 1, 626),
(1883, 'System', 0, 627),
(1884, 'Task Manager', 0, 627),
(1885, 'Windows Explorer', 0, 627),
(1886, 'Worm_spread.exe', 1, 627),
(1887, 'Antimalware Service Executable', 0, 627),
(1888, 'การใช้ CPU สูงผิดปกติ', 1, 628),
(1889, 'การใช้ Disk ต่ำกว่า 5%', 0, 628),
(1890, 'มี process ที่ชื่อไม่คุ้นเคย', 1, 628),
(1891, 'การใช้ Network มากโดยไม่เปิดเว็บ/โหลดไฟล์เอง', 0, 628),
(1892, 'ปล่อยไว้ เพราะอาจเป็นการทำงานปกติของระบบ', 0, 629),
(1893, 'รีสตาร์ทเครื่องโดยไม่ทำอะไรเพิ่ม', 0, 629),
(1894, 'ตัดการเชื่อมต่ออินเทอร์เน็ตทันที และสแกนไวรัส/มัลแวร์', 1, 629),
(1895, 'ตรวจสอบ process โดยดูที่ file location และ signature ของไฟล์', 1, 629),
(1896, 'เครื่องกำลังอัปเดต Windows อยู่', 0, 630),
(1897, 'มีโปรแกรมเบื้องหลัง เช่น Worm หรือ Malware กำลังทำงาน', 1, 630),
(1898, 'อินเทอร์เน็ตช้า', 0, 630),
(1899, 'เปิดเพลงออนไลน์อยู่', 0, 630),
(1900, 'เครื่องกำลัง Sync ข้อมูลกับ Cloud จริง ๆ', 0, 631),
(1901, 'Worm กำลังแพร่กระจายผ่านเครือข่าย', 1, 631),
(1902, 'โปรแกรมเกมที่กำลังดาวน์โหลด Patch อัตโนมัติ', 0, 631),
(1903, 'อาจมี Spyware ส่งข้อมูลออกไป', 1, 631),
(1904, 'เครื่องกำลังถูกใช้เป็น bot เพื่อยิง DDoS ออกไปยังเป้าหมาย (botnet activity)', 1, 632),
(1905, 'เครื่องกำลังดาวน์โหลดไฟล์ขนาดใหญ่อยู่จากเว็บไซต์ปกติ', 0, 632),
(1906, 'เครื่องกำลังอัปเดต Windows โดยอัตโนมัติ', 0, 632),
(1907, 'เป็นการตรวจสอบเครือข่ายปกติของระบบ', 0, 632),
(1908, 'End task ddos-bot.exe ทันที และจากนั้นเชื่อมต่อเน็ตต่อโดยไม่สแกน', 0, 633),
(1909, 'End task svchost.exe เพราะมันจะหยุดทุกบริการแล้วระบบจะปลอดภัย', 0, 633),
(1910, 'End task ddos-bot.exe → ทำ snapshot / เก็บหลักฐาน → สแกนระบบแบบออฟไลน์ → reinstall OS ถ้าจำเป็น', 1, 633),
(1911, 'ไม่ต้องทำอะไร ปล่อยไว้ประมาณ 24 ชม. เพื่อดูว่า bot จะหายไปเอง', 0, 633),
(1912, 'มี process แปลก ๆ ชื่อ ddos-bot.exe / worker.exe รันอยู่', 1, 634),
(1913, 'Network usage เพิ่มขึ้นแบบฉับพลัน (spike) แม้ผู้ใช้ไม่ได้ทำการดาวน์โหลด', 1, 634),
(1914, 'Disk usage เพิ่มสูงมากตลอดเวลา', 0, 634),
(1915, 'มีการเชื่อมต่อขาออกไปยัง IP เป้าหมายจำนวนมาก (หลาย connection ไปที่เดียวกัน)', 1, 634),
(1916, 'จำนวน process / threads สูงผิดปกติ และ CPU ถูกใช้งานอย่างมาก', 1, 634),
(1917, 'อัปเดต OS และซอฟต์แวร์อย่างสม่ำเสมอ', 1, 635),
(1918, 'ยอมรับไฟล์แนบและลิงก์ที่มาจากแหล่งไม่รู้จักเสมอ เพราะบางครั้งเป็นของจริง', 0, 635),
(1919, 'ใช้รหัสผ่านดี ๆ และเปิด 2FA สำหรับบริการสำคัญ', 1, 635),
(1920, 'ติดตั้งและใช้งาน endpoint protection ที่มีการอัปเดต signature/heuristics', 1, 635),
(2045, 'sad', 1, 672),
(2046, 'c1', 1, 673),
(2047, 'c2', 0, 673),
(2048, 'sad', 1, 674),
(2049, 'zxc', 1, 674),
(2050, 'qweer', 0, 674);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `lab_answers`
--
ALTER TABLE `lab_answers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `answer_question` (`questionId`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `lab_answers`
--
ALTER TABLE `lab_answers`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2051;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `lab_answers`
--
ALTER TABLE `lab_answers`
  ADD CONSTRAINT `answer_question` FOREIGN KEY (`questionId`) REFERENCES `labs` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
